tap "dart-lang/dart"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sass/sass"

brew "ansible"
brew "azure-cli"
brew "bash-completion"
brew "brew-cask-completion"
brew "tmux"
brew "byobu"
brew "python@3.9"
brew "cue"
brew "docker-completion"
brew "docker-compose-completion"
brew "docker-machine-completion"
brew "exa"
brew "exercism"
brew "gem-completion"
brew "git"
brew "gradle-completion"
brew "httpie"
brew "launchctl-completion"
brew "lesspipe"
brew "mas"
brew "maven-completion"
brew "nuget"
brew "nvm"
brew "open-completion"
brew "pip-completion"
brew "poetry"
brew "pre-commit"
brew "rcm"
brew "rename"
brew "ripgrep"
brew "ruby-completion"
brew "shellcheck"
brew "skopeo"
brew "starship"
brew "trash"
brew "tree"
brew "vagrant-completion"
brew "watch"
brew "wget"

cask "amazon-music"
cask "brave-browser"
cask "docker", args: { appdir: "/Applications/Developer Tools" }
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "intellij-idea", args: { appdir: "/Applications/Developer Tools" }
#cask "kaleidoscope", args: { appdir: "/Applications/Developer Tools" }
cask "karabiner-elements", args: { appdir: "/Applications/Utilities" }
cask "keybase"
cask "microsoft-remote-desktop"
cask "rectangle", args: { appdir: "/Applications/Utilities" }
cask "sourcetree", args: { appdir: "/Applications/Developer Tools" }
cask "sublime-text", args: { appdir: "/Applications/Developer Tools" }
cask "syncthing"
cask "the-unarchiver", args: { appdir: "/Applications/Utilities" }
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
cask "virtualbox-extension-pack"

mas "1Password", id: 1333542190
mas "Be Focused", id: 973134470 
# mas "Be Focused Pro", id: 961632517
mas "JSON Peep for Safari", id: 1458969831
mas "NextDNS", id: 1464122853
mas "Tailscale", id: 1475387142
